trade_exp/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтатьяАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>БанковскийСчетОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодтверждениеЗачисленияЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca94bf97-ddaf-4726-8795-eeed1a424ed7">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="81a7aaa3-d0a8-4633-a214-e676606223bc">
    <name>ИмяКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВидыОперацийЛистовСогласования/ВидыОперацийЛистовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e174d0c-fcf4-4edb-b771-d537842fb500">
  <name>ВидыОперацийЛистовСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0d0f242a-48ae-475d-ad76-05749bd4f77a">
    <name>СогласованиеТранзитов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="462fe71b-3cb9-4c1c-9888-bdb3e6556265">
    <name>СогласованиеЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="37f89f9f-becc-4e83-9791-d21c6238816b">
    <name>СогласованиеОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ПоступлениеБезналичныхДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	 Элементы.ДоговорЭквайринга.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый массив);
    
     ОтборПоОрганизации = Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация");
     ОтборПоКонтрагенту = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
     
     НовыйМассив = Новый Массив();
     НовыйМассив.Добавить(ОтборПоОрганизации);
     НовыйМассив.Добавить(ОтборПоКонтрагенту);
     
     Элементы.ДоговорЭквайринга.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
КонецПроцедуры
#Область СобытияФормы
&НаКлиенте
Процедура ПоступБезНал_ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы._СтраницаЛистыСогласования Тогда 
		ПоступБезНал_ОбновитьСписокЛистовСогласованияНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоступБезНал_СписокЛистовСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.ЛистСогласования.ФормаОбъекта", Новый Структура("Ключ", Элементы.СписокЛистовСогласования.ТекущиеДанные.ЛистСогласования));
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ПоступБезНал_ЗакрытьВыбранныеЛисты(Команда)
	ПоступБезНал_ЗакрытьЛистыНаСервере(Ложь);
	ПоступБезНал_ОбновитьСписокЛистовСогласованияНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ПоступБезНал_ЗакрытьЛисты(Команда)
	ПоступБезНал_ЗакрытьЛистыНаСервере(Истина);
	ПоступБезНал_ОбновитьСписокЛистовСогласованияНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПоступБезНал_ЗакрытьЛистыНаСервере(Все)
	Если Не Объект.Проведен Тогда
		Сообщить("Необходимо сначала провести документ!");
		Возврат;
	КонецЕсли;
	
	СуммаУжеЗакрылось= СуммаУжеЗакрытыхЛистов();
	СуммаКЗакрытию= Объект.СуммаДокумента;
	СуммаКЗакрытию= СуммаКЗакрытию-СуммаУжеЗакрылось;
	Если  СуммаКЗакрытию <= 0 Тогда
		Сообщить("Вся сумма документа уже распределена по листам согласования!");
		Возврат;
	КонецЕсли;
	
	
	Для Каждого ЛистСогласования Из СписокЛистовСогласования Цикл
		Если СуммаКЗакрытию <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если НЕ ЛистСогласования.Исполнен И (Все Или ЛистСогласования.Зачесть) Тогда
			ЛистСогласованияОбъект= ЛистСогласования.ЛистСогласования.ПолучитьОбъект();
			Если ЛистСогласованияОбъект.СуммаОплаты = 0 Тогда
				Если СуммаКЗакрытию  >= ЛистСогласования.СуммаКЗакрытию Тогда			
					ЛистСогласованияОбъект.Исполнен= Истина;
					ЛистСогласованияОбъект.Исполнитель= Пользователи.ТекущийПользователь();
					ЛистСогласованияОбъект.ДатаИсполнения= ТекущаяДата();
					
					СуммаКЗакрытию= СуммаКЗакрытию-ЛистСогласования.СуммаКЗакрытию;
				Иначе
					ЛистСогласованияОбъект.СуммаОплаты= СуммаКЗакрытию;
					
					СуммаКЗакрытию= СуммаКЗакрытию-СуммаКЗакрытию;
				КонецЕсли;	
				
			Иначе
				Если СуммаКЗакрытию  >= ЛистСогласования.СуммаКЗакрытию  Тогда			
					ЛистСогласованияОбъект.Исполнен= Истина;
					ЛистСогласованияОбъект.Исполнитель= Пользователи.ТекущийПользователь();
					ЛистСогласованияОбъект.ДатаИсполнения= ТекущаяДата();
					ЛистСогласованияОбъект.СуммаОплаты= 0;
					
					СуммаКЗакрытию= СуммаКЗакрытию-ЛистСогласования.СуммаКЗакрытию;
				Иначе
					ЛистСогласованияОбъект.СуммаОплаты= ЛистСогласованияОбъект.СуммаОплаты+СуммаКЗакрытию;
					
					СуммаКЗакрытию= СуммаКЗакрытию-СуммаКЗакрытию;
				КонецЕсли;
			КонецЕсли;
			
			ЛистСогласованияОбъект.ЗакрывающийДокумент= Объект.Ссылка;
			ЛистСогласованияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоступБезНал_ОбновитьСписокЛистовСогласования(Команда)
	ПоступБезНал_ОбновитьСписокЛистовСогласованияНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПоступБезНал_ОбновитьСписокЛистовСогласованияНаСервере()
	СписокЛистовСогласования.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛистСогласования.Ссылка КАК ЛистСогласования,
	|	ЛистСогласования.ДатаИсполнения,
	|	ЛистСогласования.Согласовано,
	|	ЛистСогласования.Автор,
	|	ЛистСогласования.Основание,
	|	ЛистСогласования.Согласован,
	|	ЛистСогласования.ОсновнойМенеджер,
	|	ЛистСогласования.Исполнитель,
	|	ЛистСогласования.Согласователь,
	|	ЛистСогласования.Организация,
	|	ЛистСогласования.СуммаДокумента,
	|	ЛистСогласования.СуммаОплаты,
	|	ЛистСогласования.СуммаСогласования,
	|	ЛистСогласования.СуммаСогласования - ЛистСогласования.СуммаОплаты КАК СуммаКЗакрытию,
	|	ЛистСогласования.Исполнен,
	|	2 КАК Сортировка,
	|	ЛистСогласования.Дата КАК Дата
	|ИЗ
	|	Документ.ЛистСогласования КАК ЛистСогласования
	|ГДЕ
	|	ЛистСогласования.Согласован = ИСТИНА
	|	И ЛистСогласования.Исполнен = ЛОЖЬ
	|	И ЛистСогласования.Аннулирован = ЛОЖЬ
	|	И ЛистСогласования.ВидОперации = &ВидОперации
	|	И ЛистСогласования.Проведен = ИСТИНА
	|	И ЛистСогласования.Организация = &Организация
	|	И ЛистСогласования.Контрагент = &Контрагент
	|	И ЛистСогласования.Договор В(&Договор)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛистСогласования.Ссылка,
	|	ЛистСогласования.ДатаИсполнения,
	|	ЛистСогласования.Согласовано,
	|	ЛистСогласования.Автор,
	|	ЛистСогласования.Основание,
	|	ЛистСогласования.Согласован,
	|	ЛистСогласования.ОсновнойМенеджер,
	|	ЛистСогласования.Исполнитель,
	|	ЛистСогласования.Согласователь,
	|	ЛистСогласования.Организация,
	|	ЛистСогласования.СуммаДокумента,
	|	ЛистСогласования.СуммаОплаты,
	|	ЛистСогласования.СуммаСогласования,
	|	ЛистСогласования.СуммаСогласования - ЛистСогласования.СуммаОплаты,
	|	ЛистСогласования.Исполнен,
	|	1,
	|	ЛистСогласования.Дата
	|ИЗ
	|	Документ.ЛистСогласования КАК ЛистСогласования
	|ГДЕ
	|	ЛистСогласования.ЗакрывающийДокумент = &ЗакрывающийДокумент
	|	И ЛистСогласования.Исполнен = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка,
	|	Дата";
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности);
	
	мДоговоров= Объект.РасшифровкаПлатежа.Выгрузить().ВыгрузитьКолонку("ОснованиеПлатежа");
	
	Запрос.УстановитьПараметр("Договор", мДоговоров);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("ЗакрывающийДокумент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокЛистовСогласования.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область Воспомогательные

&НаСервере
Функция СуммаУжеЗакрытыхЛистов()
	Сумма= 0;
	Для Каждого ЛистСогласования Из СписокЛистовСогласования Цикл
		Если ЛистСогласования.Исполнен  Тогда
			Сумма=Сумма+ЛистСогласования.СуммаКЗакрытию;
		КонецЕсли;
	КонецЦикла;
	Возврат Сумма;
КонецФункции


&НаСервере
Процедура ОбновитьСостояниеСервер()
	Документы.ПоступлениеБезналичныхДенежныхСредств.РассчитатьСостояние(Объект.ДатаПроведенияБанком,
	Объект.Организация,
	Объект.Контрагент,
	ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Док_КонтрагентПриИзмененииПосле(Элемент)
	ОбновитьСостояниеСервер();
КонецПроцедуры

&После ("ПриЧтенииСозданииНаСервере") 
процедура Док_ПриЧтенииСозданииНаСервере()
	ОбновитьСостояниеСервер();
конецпроцедуры	
&После ("ПослеЗаписиНаСервере") 
Процедура Док_ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСостояниеСервер();    
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.Проведен Тогда       
    	ПоступБезНал_ОбновитьСписокЛистовСогласованияНаСервере();	   
		ПоступБезНал_ЗакрытьЛистыНаСервере(Истина);
	КонецЕсли;	
конецпроцедуры	

#КонецОбласти
